InformationRegisters/ФорумПоОбещаниям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ФорумПоОбещаниям</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обещание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Обещание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ФорумПоОбещаниям/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбещанияПриАктивизацииСтроки(Элемент)
	Если Элементы.Обещания.ТекущиеДанные<>Неопределено Тогда
		Для каждого Эл Из ЭтаФорма.Список.Отбор.Элементы Цикл
			Если Строка(Эл.ЛевоеЗначение)="Обещание" Тогда
			     ЭтаФорма.Список.Отбор.Элементы.Удалить(Эл);
				 Прервать;
			КонецЕсли; 
		КонецЦикла; 
		ТекОбещание=Элементы.Обещания.ТекущиеДанные.Ссылка;
		ЭлементОтбора = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Обещание");
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование 	= Истина;
		ЭлементОтбора.ПравоеЗначение 	= ТекОбещание;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекФизЛицо=глЗначениеПеременной("глТекущийПользователь").ФизЛицо;
	ТекОбещаниеОткрытие=Параметры.НачальноеОбещание;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(ТекОбещаниеОткрытие) Тогда
		Элементы.Обещания.ТекущаяСтрока=ТекОбещаниеОткрытие;	
	КонецЕсли;
	ПодключитьОбработчикОжидания("ПозиционироватьНаПослСтроке",2,Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПозиционироватьНаПослСтроке()
  	Ключ=ПозиционироватьНаПослСтрокеСервер(ТекОбещание,ДатаПослСообщения);
	Если Ключ<>Неопределено Тогда
		Элементы.Список.Обновить();
		Элементы.Список.ТекущаяСтрока=Ключ;
	КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПозиционироватьНаПослСтрокеСервер(ТекОбещание,ДатаПослСообщения)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ФорумПоОбещаниямСрезПоследних.Период) КАК Период
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	РегистрСведений.ФорумПоОбещаниям.СрезПоследних(, Обещание = &Обещание) КАК ФорумПоОбещаниямСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФорумПоОбещаниямСрезПоследних.ФизЛицо,
		|	ФорумПоОбещаниямСрезПоследних.Обещание,
		|	ФорумПоОбещаниямСрезПоследних.Период
		|ИЗ
		|	РегистрСведений.ФорумПоОбещаниям.СрезПоследних(, Обещание = &Обещание) КАК ФорумПоОбещаниямСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
		|		ПО ФорумПоОбещаниямСрезПоследних.Период = вт.Период";
    Запрос.УстановитьПараметр("Обещание",ТекОбещание);
	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Отбор=Новый Структура("Период, Физлицо, Обещание");
		ЗаполнитьЗначенияСвойств(Отбор,ВыборкаДетальныеЗаписи);
		КлючЗаписиПосл=РегистрыСведений.ФорумПоОбещаниям.СоздатьКлючЗаписи(Отбор);
		КлючЗаписи=КлючЗаписиПосл;
		Если ДатаПослСообщения<>КлючЗаписи.Период Тогда
			Если КлючЗаписи<>Неопределено Тогда
				ДатаПослСообщения=КлючЗаписи.Период;
			КонецЕсли; 
			Возврат   КлючЗаписи;
		Иначе
			Возврат Неопределено;
		КонецЕсли; 
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	ОтправитьСообщениеСервер();
	Элементы.Список.Обновить();
	СообщениеВЧат="";
КонецПроцедуры

&НаСервере
Процедура ОтправитьСообщениеСервер()
	Мен=РегистрыСведений.ФорумПоОбещаниям.СоздатьМенеджерЗаписи();
	Мен.Период=ТекущаяДата();
	Мен.ФизЛицо=ТекФизЛицо;
	Мен.Обещание=ТекОбещание;
	Мен.Сообщение=СообщениеВЧат;
	Мен.Записать(Истина);
КонецПроцедуры
